8.1 分层索引

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series(np.random.randn(9),
        index=[['a','a','a','b','b','c','c','d','d'],
        [1,2,3,1,3,1,2,2,3]])

In [3]:
data

a  1   -0.868802
   2   -0.621967
   3   -1.042401
b  1    2.199106
   3   -0.871266
c  1   -1.487560
   2   -0.309322
d  2   -1.947994
   3    0.345497
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
data.loc[['b','d']]

b  1    2.199106
   3   -0.871266
d  2   -1.947994
   3    0.345497
dtype: float64

In [6]:
data.loc[:,2]

a   -0.621967
c   -0.309322
d   -1.947994
dtype: float64

In [7]:
data.unstack()

          1         2         3
a -0.868802 -0.621967 -1.042401
b  2.199106       NaN -0.871266
c -1.487560 -0.309322       NaN
d       NaN -1.947994  0.345497

In [8]:
data.unstack().stack()

a  1   -0.868802
   2   -0.621967
   3   -1.042401
b  1    2.199106
   3   -0.871266
c  1   -1.487560
   2   -0.309322
d  2   -1.947994
   3    0.345497
dtype: float64

In [9]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a',         'a','b','b'], [1,2,1,2]], columns=[['Ohio','Ohio',               'Colarado'],['Green','Red','Green']])
frame

     Ohio     Colarado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [10]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colarado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [11]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [12]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

前面介绍的带有层级名称的DataFrame的列可以这样创建：MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])

8.1.3 使用DataFrame的列进行索引

In [21]:
frame = pd.DataFrame({'a': range(7),'b': range(7,0,-1),
            'c': ['one','one','one','two','two','two','two'],               'd': [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [23]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [24]:
frame.set_index(['c','d'], drop=0)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [25]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

8.2 联合与合并数据集

In [26]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1': range(7)})
df2 = pd.DataFrame({'key':['a','b','d'],'data2': range(3)})

In [30]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [31]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [32]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [35]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [42]:
df3 = pd.DataFrame({'lkey': ['b','b','b','c','a','a','b'],                         'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    b      2
3    c      3
4    a      4
5    a      5
6    b      6

In [43]:
df4 = pd.DataFrame({'rkey': ['a','b','d'],'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [41]:
pd.merge(df3,df4,left_on= 'lkey', right_on= 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      2    b      1
3    b      6    b      1
4    a      4    a      0
5    a      5    a      0

In [44]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0